RT32024TEST.ОбменМагистральБП/src/DataProcessors/МС_ВыгрузитьСчетНаОплатуПоставщика/МС_ВыгрузитьСчетНаОплатуПоставщика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>МС_ВыгрузитьСчетНаОплатуПоставщика</name>
  <attributes>
    <name>Ссылка</name>
    <type>
      <types>DocumentRef.СчетНаОплатуПоставщика</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧастьЗапасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураБП</name>
      <type>
        <types>CatalogRef.МС_НоменклатураБП</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

RT32024TEST.ОбменМагистральБП/src/Documents/СчетНаОплатуПоставщика/СчетНаОплатуПоставщика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="c5463756-11fa-43bd-9f03-cc67ad6147ae">
  <name>СчетНаОплатуПоставщика</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="cc899534-9172-4fc0-9dbc-d874343024c4">
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9d49ba23-cc7f-4953-96a7-b5be0a3d7967">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bf73bb6d-15ae-4c55-92a5-fc3e8939fe1b">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="84755c43-855a-4600-96c6-fdfa2f9fd49f">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="65908bd4-32ee-4bdf-85a6-989856b7cf66">
    <name>СуммаВключаетНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="923f77f3-e011-4b33-a9be-ff9ebc5e8573">
    <name>ДатаВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="b1241df7-a45f-4d84-9ebd-b5bbce5fbb8b">
    <name>НомерВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="019acb42-d09a-42b8-84d5-9a73cc37f25b">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="7fae79e4-9d95-4cbc-8f43-8262494ab49d">
    <name>Запасы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="f2491c22-e302-48a7-aa3f-0d91962bcee1">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="066ad5b2-00b9-4fcc-8b96-2f7a83dee1ce">
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="d78589b1-d531-44b8-8e66-39369bb2bdc4">
      <name>Всего</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="131576e5-bb16-48ff-a5ae-77083b515273">
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="fb89c40c-6c41-405d-869c-edb600cfbfb5">
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="630fba5b-c9ba-45d3-9943-f18884994873">
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="4c1455aa-165b-454b-a01c-eb0411a40669">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

RT32024TEST.ОбменМагистральБП/src/DataProcessors/МС_ВыгрузитьСчетНаОплатуПоставщика/Forms/Форма/Module.bsl
// @strict-types


#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// При создании на сервере.
// 
// Параметры:
//  Отказ - Булево - Отказ
//  СтандартнаяОбработка - Булево - Стандартная обработка
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.Ссылка = Параметры.Ссылка; // ДокументСсылка.СчетНаОплатуПоставщика
	ЗаполнитьТабличнуюЧастьЗапасы();
	НайтиНоменклатуруБПНаСервере();
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ОтправитьВБухгалтерию(Команда)
	ЗаписатьСоответствиеВНоменклатуру();
	ОтправитьВБухгалтериюНаСервере();
	
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ОтправитьВБухгалтериюНаСервере()
	РеквизитФормыВЗначение("Объект").ОтправитьСчетНаОплатуПоставщика();	
КонецПроцедуры

&НаСервере
Процедура НайтиНоменклатуруБПНаСервере()
	
	Для каждого СтрокаЗапасы Из Объект.ТабличнаяЧастьЗапасы Цикл
		Если ЗначениеЗаполнено(СтрокаЗапасы.НоменклатураБП) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаПоиска = СтрокаЗапасы.Номенклатура.Наименование;
		Нашли = МС_ОбщийМодульПоиска.НайтиНоменклатуруПолнотекстово(СтрокаПоиска, 1);
		Если Нашли.Количество() > 0 Тогда
			СтрокаЗапасы.НоменклатураБП = Нашли[0]; //СправочникСсылка.МС_НоменклатураБП
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабличнуюЧастьЗапасы()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СчетНаОплатуПоставщика.Номенклатура КАК Номенклатура,
		|	СчетНаОплатуПоставщика.Номенклатура.МС_НоменклатураБП КАК НоменклатураБП
		|ИЗ
		|	Документ.СчетНаОплатуПоставщика.Запасы КАК СчетНаОплатуПоставщика
		|ГДЕ
		|	СчетНаОплатуПоставщика.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = Объект.ТабличнаяЧастьЗапасы.Добавить();
		НоваяСтрока.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура; // СправочникСсылка.Номенклатура
		НоваяСтрока.НоменклатураБП = ВыборкаДетальныеЗаписи.НоменклатураБП; // СправочникСсылка.МС_НоменклатураБП
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьСоответствиеВНоменклатуру()
	Для каждого СтрокаЗапасы Из Объект.ТабличнаяЧастьЗапасы Цикл
		Если Не ЗначениеЗаполнено(СтрокаЗапасы.НоменклатураБП) Тогда
			Продолжить;
		КонецЕсли;
		Если СтрокаЗапасы.Номенклатура.МС_НоменклатураБП = СтрокаЗапасы.НоменклатураБП Тогда
			Продолжить; 
		КонецЕсли;
		
		Номенклатура = СтрокаЗапасы.Номенклатура.ПолучитьОбъект();	
		Номенклатура.МС_НоменклатураБП = СтрокаЗапасы.НоменклатураБП;
		Номенклатура.Записать();
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
